// ------------------------------------------------------------------------------------------
//
// レンダリング処理の説明[renderer.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

#ifndef _RENDERER_H_
#define _RENDERER_H_	 // ファイル名を基準を決める

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------
#include "main.h"

// ------------------------------------------------------------------------------------------
//
// マクロ関数
//
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
//
// 前方宣言
//
// ------------------------------------------------------------------------------------------
class CDebugproc;

// ------------------------------------------------------------------------------------------
//
// クラス
//
// ------------------------------------------------------------------------------------------
class CRenderer
{
public:
	/* 関数 */
	CRenderer();
	~CRenderer();
	HRESULT  Init(HWND hWnd, BOOL bWindow);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	LPDIRECT3DDEVICE9 GetDevice(void);

protected:

private:
	/* 変数 */
	LPDIRECT3D9 m_pD3D;				// Direct3Dオブジェクトのポインタ
	LPDIRECT3DDEVICE9 m_pDevice;	// Direct3Dデバイスのポインタ
#ifdef _DEBUG
	static CDebugproc * m_debugproc;		// デバッグ表示
	void DrawFPS(void);				// FPS関数
	LPD3DXFONT	m_pFont = NULL;		// フォントへのポインタ
#endif
};

#endif // !_RENDERER_H_