// ------------------------------------------------------------------------------------------
//
// クリア画面処理の説明[clear.cpp]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------
#include "clear.h"
#include "input.h"
#include "joypad.h"
#include "fade.h"
#include "sound.h"
#include "clearcomment.h"
#include "element.h"

// ------------------------------------------------------------------------------------------
//
// クリア初期化処理
//
// ------------------------------------------------------------------------------------------

void InitClear(void)
{
	// ゲーム要素の初期化処理
	InitElement();

	// クリアコメントの初期化処理
	InitClearComment();
}

// ------------------------------------------------------------------------------------------
//
// クリア終了処理
//
// ------------------------------------------------------------------------------------------

void UninitClear(void)
{
	// ゲーム要素の終了処理
	UninitElement();

	// クリアコメントの終了処理
	UninitClearComment();
}

// ------------------------------------------------------------------------------------------
//
// クリア更新処理
//
// ------------------------------------------------------------------------------------------

void UpdateClear(void)
{
	// ゲーム要素の更新処理
	UpdateElement();

	// クリアコメントの更新処理
	UpdateClearComment();

	// エンター押したとき
	if (GetKeyboardTrigger(DIK_RETURN) && GetFade() == FADE_NONE ||
		GetJoyboardTrigger(0, JOYPADKEY_B) && GetFade() == FADE_NONE ||
		GetKeyboardTrigger(DIK_J) && GetFade() == FADE_NONE)
	{
		// SE
		PlaySound(SOUND_LABEL_SE_ENTER);

		// ランキングへ
		SetFade(MODE_STATI);
	}
}

// ------------------------------------------------------------------------------------------
//
// クリア描画処理
//
// ------------------------------------------------------------------------------------------

void DrawClear(void)
{
	// ゲーム要素の描画処理
	DrawElement();

	// クリアコメントの描画処理
	DrawClearComment();
}