// ------------------------------------------------------------------------------------------
//
// クリアコメント画面ヘッダー処理の説明[clearcomment.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

#ifndef _CLEARCOMMENT_H_
#define _CLEARCOMMENT_H_	 // ファイル名を基準を決める

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS

#include "main.h"

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------

// 基本プロトタイプ	//
void InitClearComment(void);
void UninitClearComment(void);
void UpdateClearComment(void);
void DrawClearComment(void);

#endif