// ------------------------------------------------------------------------------------------
//
// ゲーム処理の説明[game.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

#ifndef _GAME_H_
#define _GAME_H_	 // ファイル名を基準を決める

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS

#include "main.h"

// ------------------------------------------------------------------------------------------
//
// 状態
//
// ------------------------------------------------------------------------------------------
typedef enum
{
	GAMESTATE_NONE = 0,	// なんもない
	GAMESTATE_NORMAL,	// 通常
	GAMESTATE_CLEAR,	// クリア
	GAMESTATE_GAMEOVER,	// ゲームオーバー
	GAMESTATE_TITLE,	// タイトルへ
	GAMESTATE_POUSE,	// ポーズ
	GAMESTATE_SELECT,	// 選択
	GAMESTATE_BOSS,		// ボス
	GAMESTATE_MAX 
} GAMESTATE;

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------

// 基本プロトタイプ	//
void InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);

void SetGameState(GAMESTATE state);
GAMESTATE GetGameStete(void);

#endif