// ------------------------------------------------------------------------------------------
//
// ゲームフェード処理 [gamefade.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------
#ifndef _GAMEFADE_H_
#define _GAMEFADE_H_

#define _CRT_SECURE_NO_WARNINGS

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------
#include "main.h"

#include "game.h"
// ------------------------------------------------------------------------------------------
//
// ゲームフェードの状態
//
// ------------------------------------------------------------------------------------------
typedef enum
{
	GAMEFADE_NONE = 0,		// 何もない状態
	GAMEFADE_IN,			// ゲームフェードイン処理
	GAMEFADE_OUT,			// ゲームフェードアウト処理
	GAMEFADE_MAX
} GAMEFADE;

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------
void InitGameFade(GAMESTATE modeNext);
void UninitGameFade(void);
void UpdateGameFade(void);
void DrawGameFade(void);

void SetGameFade(GAMESTATE modeNext);
GAMEFADE GetGameFade(void);

#endif
