// ------------------------------------------------------------------------------------------
//
// ゲームオーバーコメントヘッダー処理の説明[gameovercomment.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

#ifndef _GAMEOVERCOMMENT_H_
#define _GAMEOVERCOMMENT_H_	 // ファイル名を基準を決める

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS

#include "main.h"

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------

// 基本プロトタイプ	//
void InitGameoverComment(void);
void UninitGameoverComment(void);
void UpdateGameoverComment(void);
void DrawGameoverComment(void);

#endif