// ------------------------------------------------------------------------------------------
//
// ゲージ処理のヘッダーファイル [hpgauge.h]
// Author:Koki Nishiyama
//
// ------------------------------------------------------------------------------------------
#ifndef _HPGAUGE_H_
#define _HPGAUGE_H_

#define _CRT_SECURE_NO_WARNINGS

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------
#include "main.h"

// ------------------------------------------------------------------------------------------
// 列挙型
// ------------------------------------------------------------------------------------------
// ---------ゲージの役割---------- //
typedef enum
{
	HPGAUGESYSTEM_HP = 0,
	HPGAUGESYSTEM_MP,
	HPGAUGESYSTEM_MAX
} HPGAUGESYSTEM;

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------
void InitHpGauge(void);
void UninitHpGauge(void);
void UpdateHpGauge(void);
void DrawHpGauge(void);

// HP変更
void ChangeHpGauge(
	int nCntHpGauge,	// カウント
	float fLife,		// ライフ
	float fLastLife		// 上限ライフ
);

// 最大HP変更
void ChangeMaxHpGauge(
	int nCntHpGauge,	// カウント
	float fMaxHP		// 最大HP
);
#endif
