// ------------------------------------------------------------------------------------------
//
// スコア処理 [pointscore.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------
#ifndef _POINTSCORE_H_
#define _POINTSCORE_H_

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------
#include "main.h"

// ------------------------------------------------------------------------------------------
//
// 構造体定義
//
// ------------------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXCOLOR	col;
	int nPointScore;
	int nCntAnim;
	bool bUse;
} POINTSCORE;
// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------
void InitPointScore(void);
void UninitPointScore(void);
void UpdatePointScore(void);
void DrawPointScore(void);

// スコア計算関数
void AddPointScore(D3DXVECTOR3 pos,int nValue);
POINTSCORE *GetPointScore(void);
#endif
