// ------------------------------------------------------------------------------------------
//
// ポーズコメントヘッダー処理の説明[pousecoment.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------
#ifndef _POUSECOMENT_H_
#define _POUSECOMENT_H_	 // ファイル名を基準を決める

// ------------------------------------------------------------------------------------------
// インクルードファイル
// ------------------------------------------------------------------------------------------
#include "main.h"

// ------------------------------------------------------------------------------------------
// マクロ定義
// ------------------------------------------------------------------------------------------
#define POUSECOMENT_ON_Y (320)		// 上
#define POUSECOMENT_MAX (2)			// 画像数

// ------------------------------------------------------------------------------------------
// 列挙型
// ------------------------------------------------------------------------------------------
// ---------タイプ---------- //
typedef enum
{
	POUSECOMMENT_POUSE = 0,
	POUSECOMMENT_GAME,
	POUSECOMMENT_TITLE,
	POUSECOMMENT_RESTART,
	POUSECOMMENT_MAX
} POUSECOMMENT;

// ------------------------------------------------------------------------------------------
// 構造体定義
// ------------------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;		// 位置
	D3DXVECTOR3 move;		// 移動量
	D3DXCOLOR	col;		// カラー
	int nType;				// 種類
	int nCntCol;			// カラーカウント
	bool bUse;				// 使用しているかどうか
} POUSECOMENT;

// ------------------------------------------------------------------------------------------
// プロトタイプ宣言
// ------------------------------------------------------------------------------------------
// 基本プロトタイプ	//
void InitPouseComent(void);
void UninitPouseComent(void);
void UpdatePouseComent(void);
void DrawPouseComent(void);

int GetPouseCommentPouse(void);
#endif