// ------------------------------------------------------------------------------------------
//
// ランキング背景処理の説明[rank.cpp]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------

#include "rank.h"
#include "rank5.h"
#include "ranking.h"
#include "input.h"
#include "joypad.h"
#include "fade.h"
#include "sound.h"
#include "titlecomment.h"
#include "element.h"

// ------------------------------------------------------------------------------------------
//
// マクロ定義
//
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
//
// グローバル変数
//
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
//
// ランキング背景初期化処理
//
// ------------------------------------------------------------------------------------------

void InitRank(void)
{
	// ゲーム要素の初期化処理
	InitElement();

	// ランク５の初期化処理
	InitRank5();

	// ランキングの初期化処理
	InitRanking();

	// ランキング記録
	AddRanking();
}

// ------------------------------------------------------------------------------------------
//
// ランキング背景終了処理
//
// ------------------------------------------------------------------------------------------

void UninitRank(void)
{
	// ゲーム要素の終了処理
	UninitElement();

	// ランク５の終了処理
	UninitRank5();

	// ランキングの終了処理
	UninitRanking();
}

// ------------------------------------------------------------------------------------------
//
// ランキング背景更新処理
//
// ------------------------------------------------------------------------------------------

void UpdateRank(void)
{
	// ゲーム要素の更新処理
	UpdateElement();

	// ランク５の更新処理
	UpdateRank5();

	// ランキングの更新処理
	UpdateRanking();

	static int nCnt = 0;
	nCnt++;

	if (GetKeyboardTrigger(DIK_RETURN) && GetFade() == FADE_NONE ||
		GetJoyboardTrigger(0, JOYPADKEY_B) && GetFade() == FADE_NONE ||
		GetKeyboardTrigger(DIK_J) && GetFade() == FADE_NONE ||
		nCnt >= 200 && GetFade() == FADE_NONE)
	{
		// SE
		PlaySound(SOUND_LABEL_SE_ENTER);

		// タイトルへ
		SetFade(MODE_TITLE);
		
		// カウントリセット
		nCnt = 0;
	}
}

// ------------------------------------------------------------------------------------------
//
// ランキング背景描画処理
//
// ------------------------------------------------------------------------------------------
void DrawRank(void)
{
	// ゲーム要素の描画処理
	DrawElement();

	// ランク５の描画処理
	DrawRank5();

	// ランキングの描画処理
	DrawRanking();
}