// ------------------------------------------------------------------------------------------
//
// 統計処理 [Statipoint.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------
#ifndef _STATIPOINT_H_
#define _STATIPOINT_H_

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------
#define _CRT_SECURE_NO_WARNINGS

#include "main.h"

// ------------------------------------------------------------------------------------------
// 列挙型
// ------------------------------------------------------------------------------------------

// ---------モーションセット---------- //
typedef enum
{
	STATIPOINTTYPE_TIME = 0,	// タイム
	STATIPOINTTYPE_TIMEBORNUS,	// タイムボーナス
	STATIPOINTTYPE_ENEMY,		// 撃破数
	STATIPOINTTYPE_ENEMYBORNUS,	// 撃破ボーナス
	STATIPOINTTYPE_SUM,			// 合計
	STATIPOINTTYPE_MAX
} STATIPOINTTYPE;

// ------------------------------------------------------------------------------------------
//
// 構造体定義
//
// ------------------------------------------------------------------------------------------
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXVECTOR3 size;
	int nPoint;
	int nId;
} STATIPOINT;

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------
void InitStatipoint(void);
void UninitStatipoint(void);
void UpdateStatipoint(void);
void DrawStatipoint(void);

// 統計計算関数
void AddStatipoint(void);

#endif
