// ------------------------------------------------------------------------------------------
//
// タイトル処理の説明[title.cpp]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------
#include "title.h"

#include "input.h"

#include "joypad.h"

#include "fade.h"

#include "sound.h"

#include "titlecomment.h"

#include "camera.h"

#include "floor.h"

#include "wall.h"

#include "materials.h"

#include "giraffe.h"

#include "buffalo.h"

#include "light.h"

#include "shadow.h"

#include "trajectory.h"

#include "bullet.h"

#include "hemisphere.h"

#include "dome.h"

#include "Billboard.h"

#include "effect.h"

#include "explosion.h"

#include "rollscore.h"

#include "element.h"

// ------------------------------------------------------------------------------------------
//
// マクロ定義
//
// ------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------
void Update_TitleMode(void);

// ------------------------------------------------------------------------------------------
//
// グローバル変数
//
// ------------------------------------------------------------------------------------------
int		g_nCntTime = 0;
bool	g_bStart = false;

// ------------------------------------------------------------------------------------------
//
// タイトル初期化処理
//
// ------------------------------------------------------------------------------------------

void InitTitle(void)
{
	g_nCntTime = 0;		// ランキングに画面切り替えにかかる時間
	g_bStart = false;	// キーボード用

	// 要素の初期化処理
	InitElement();

	// タイトルコメント初期化
	InitTitleComment();
}

// ------------------------------------------------------------------------------------------
//
// タイトル終了処理
//
// ------------------------------------------------------------------------------------------

void UninitTitle(void)
{
	// ゲーム要素の終了処理
	UninitElement();

	// タイトルコメント終了処理
	UninitTitleComment();
}

// ------------------------------------------------------------------------------------------
//
// タイトル更新処理
//
// ------------------------------------------------------------------------------------------

void UpdateTitle(void)
{
	// ゲーム要素の更新処理
	UpdateElement();

	// タイトルコメント更新処理
	UpdateTitleComment();

	// タイトルモード切替
	Update_TitleMode();
}

// ------------------------------------------------------------------------------------------
//
// タイトルモード切り替え処理
//
// ------------------------------------------------------------------------------------------
void Update_TitleMode(void)
{
	// タイトルコメント情報取得
	TITLECOMMENT *pTitleComment = GetTitleComment(TITLECOMMENTTYPE_RION);

	// コメントが全部出たら
	if (pTitleComment->bPut == true)
	{
		g_nCntTime++;	// カウントタイムアップ

		// キーボードで押した場合
		if (GetKeyboardTrigger(DIK_RETURN) && GetFade() == FADE_NONE ||
			GetKeyboardTrigger(DIK_J) && GetFade() == FADE_NONE)
		{
			// SE
			PlaySound(SOUND_LABEL_SE_ENTER);

			// キーボード用の説明
			g_bStart = false;

			// チュートリアルへ
			SetFade(MODE_TUTORIAL);
		}

		// ジョイパッドで押した場合
		if (GetJoyboardTrigger(0, JOYPADKEY_B) && GetFade() == FADE_NONE)
		{
			// SE
			PlaySound(SOUND_LABEL_SE_ENTER);

			// ジョイパッド用の説明
			g_bStart = true;

			// チュートリアルへ
			SetFade(MODE_TUTORIAL);
		}

		if (g_nCntTime >= 500 && GetFade() == FADE_NONE)
		{
			// ランキングへ
			SetFade(MODE_RANK);

			// カウントリセット
			g_nCntTime = 0;
		}
	}
}

// ------------------------------------------------------------------------------------------
//
// タイトル描画処理
//
// ------------------------------------------------------------------------------------------
void DrawTitle(void)
{
	// ゲーム要素の描画処理
	DrawElement();

	// タイトルコメント描画処理
	DrawTitleComment();
}

// ------------------------------------------------------------------------------------------
// キーボードかジョイパッドか
// ------------------------------------------------------------------------------------------
bool GetButtenTitle(void)
{
	return g_bStart;
}
