// ------------------------------------------------------------------------------------------
//
// コメントヘッダー処理の説明[titlecomment.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

#ifndef _TITLECOMMENT_H_
#define _TITLECOMMENT_H_	 // ファイル名を基準を決める

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS

#include "main.h"

// ------------------------------------------------------------------------------------------
//
// マクロ定義
//
// ------------------------------------------------------------------------------------------
#define TITLECOMENT_ON_Y (350.0f)		// 上

// ------------------------------------------------------------------------------------------
//
// コメント種類
//
// ------------------------------------------------------------------------------------------
typedef enum
{
	TITLECOMMENTTYPE_NAME = 0,
	TITLECOMMENTTYPE_RION,
	TITLECOMMENTTYPE_MAX
}TITLECOMMENTTYPE;

// ------------------------------------------------------------------------------------------
//
// 構造体定義
//
// ------------------------------------------------------------------------------------------

typedef struct
{
	D3DXVECTOR3 pos;	// 位置
	D3DXVECTOR3 move;	// 移動量
	D3DXVECTOR2 size;	// サイズ
	D3DXVECTOR2 tex;	// テクスチャ
	bool bPut;			// 目的地に着いたかどうか
	bool bUse;			// 使用しているかどうか
} TITLECOMMENT;

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------

// 基本プロトタイプ	//
void InitTitleComment(void);
void UninitTitleComment(void);
void UpdateTitleComment(void);
void DrawTitleComment(void);
TITLECOMMENT *GetTitleComment(int nCntTitleComment);

#endif