// ------------------------------------------------------------------------------------------
//
// チュートリアルヘッダー処理の説明[tutorial.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_	 // ファイル名を基準を決める

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS

#include "main.h"

// ------------------------------------------------------------------------------------------
//
// 列挙型
//
// ------------------------------------------------------------------------------------------
// ---------タイプ---------- //
typedef enum
{
	TUTORIALSSTATE_NORMAL = 0,
	TUTORIALSSTATE_SELECT,
	TUTORIALSSTATE_GAME,
	TUTORIALSSTATE_MAX
} TUTORIALSSTATE;

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------

// 基本プロトタイプ	//
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

void SetTutorialState(TUTORIALSSTATE state);
#endif