//=============================================================================
//
// ライト処理 [light.h]
// Author : KOKI_NISHIYAMA
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define LIGHT_MAX (3)

// ------------------------------------------
//
// クラス
//
// ------------------------------------------
class CLight
{
public:
	/* 関数 */
	CLight();
	~CLight();
	void Init(void);
	void Uninit(void);
	void Update(void);
	static CLight * Create(void);	// 作成
protected:

private:
	D3DLIGHT9 m_light[LIGHT_MAX];	// ライト情報
	// 拡散光の色
	D3DXCOLOR m_col[LIGHT_MAX] =		// カラー
	{
		D3DXCOLOR(1.0f,1.0f,1.0f,1.0f),
		D3DXCOLOR(0.5f,0.5f,0.5f,1.0f),
		D3DXCOLOR(0.2f,0.2f,0.2f,1.0f),
	};
	// 光の方向
	D3DXVECTOR3 m_VecDir[LIGHT_MAX] =// 方向
	{
		D3DXVECTOR3(-1.0f,-0.2f,-1.0f),	// メインライト
		D3DXVECTOR3(-0.5f, -0.5, 0.0f),	// サブ１
		D3DXVECTOR3(0.5f, -1.0f, 0.5f),	// サブ２
	};
};

#endif
