// ----------------------------------------
//
// 箱の当たり判定処理の説明[boxcollider.cpp]
// Author : Koki Nishiyama
//
// ----------------------------------------

// ----------------------------------------
//
// インクルードファイル
//
// ----------------------------------------
#include "boxcollider.h"

// ----------------------------------------
//
// 静的変数宣言
//
// ----------------------------------------

// ----------------------------------------
// コンストラクタ処理
// ----------------------------------------
CBoxcollider::CBoxcollider()
{
	// 変数の初期化
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_size = D3DXVECTOR2(0.0f, 0.0f);
	m_rot = 0;
}

// ----------------------------------------
// イニシャライザコンストラクタ
// ----------------------------------------
CBoxcollider::CBoxcollider(ACTOR actor, LAYER layer) : CScene::CScene(actor,layer)
{
	// 変数の初期化
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_rot = 0;
	m_size = D3DXVECTOR2(0.0f, 0.0f);
}

// ----------------------------------------
// デストラクタ処理
// ----------------------------------------
CBoxcollider::~CBoxcollider()
{
}

// ----------------------------------------
// 初期化処理
// ----------------------------------------
void CBoxcollider::Init(void)
{
}

// ----------------------------------------
// 終了処理
// ----------------------------------------
void CBoxcollider::Uninit(void)
{
}

// ----------------------------------------
// 更新処理
// ----------------------------------------
void CBoxcollider::Update(void)
{
}

// ----------------------------------------
// 描画処理
// ----------------------------------------
void CBoxcollider::Draw(void)
{
}

#ifdef _DEBUG
//-------------------------------------------------------------------------------------------------------------
// デバッグ表示
//-------------------------------------------------------------------------------------------------------------
void CBoxcollider::Debug(void)
{
}
#endif // _DEBUG

// ----------------------------------------
// 作成処理
// ----------------------------------------
CBoxcollider * CBoxcollider::Create()
{
	// 変数宣言
	CBoxcollider * pBoxcollider;		// 箱の当たり判定クラス

	// メモリの生成(初め->基本クラス,後->派生クラス)
	pBoxcollider = new CBoxcollider(ACTOR_BOXCOLLIDER,LAYER_UI);

	// 初期化処理
	pBoxcollider->Init();
	
	// 生成したオブジェクトを返す
	return pBoxcollider;
}

// ----------------------------------------
// サイズ設定処理
// ----------------------------------------
void CBoxcollider::SetSize(D3DXVECTOR2 size)
{
	m_size = size;
}

// ----------------------------------------
// 位置情報設定処理
// ----------------------------------------
void CBoxcollider::SetPosition(D3DXVECTOR3 pos)
{
}

// ----------------------------------------
// 回転情報取得処理
// ----------------------------------------
void CBoxcollider::SetRot(float frot)
{
}

// ----------------------------------------
// サイズ情報取得処理
// ----------------------------------------
D3DXVECTOR2 CBoxcollider::GetSize(void)
{
	return m_size;
}

// ----------------------------------------
// 位置情報取得処理
// ----------------------------------------
D3DXVECTOR3 CBoxcollider::GetPosition(void)
{
	return m_pos;
}
