// ----------------------------------------
//
// デバッグ表示処理の説明[debugproc.h]
// Author : Koki Nishiyama
//
// ----------------------------------------
#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_	 // ファイル名を基準を決める

// ----------------------------------------
//
// インクルードファイル
//
// ----------------------------------------
#include "main.h"

// ----------------------------------------
//
// マクロ定義
//
// ----------------------------------------
#define MAX_DEBUGPROC (10)

// ------------------------------------------------------------------------------------------
//
// クラス
//
// ------------------------------------------------------------------------------------------

void InitDebug(LPDIRECT3DDEVICE9 m_pDevice);
void UninitDebug(void);
void PrintDebug(char* fmt, ...);
void DrawDebug(void);

#endif