//*************************************************************************************************************
//
// オブジェクト用ウィンドウ処理[objwindow.h]
// Author : Koki Nishiyama
//
//*************************************************************************************************************
#ifndef _OBJWINDOW_H_
#define _OBJWINDOW_H_

//-------------------------------------------------------------------------------------------------------------
// インクルードファイル
//-------------------------------------------------------------------------------------------------------------
#include "main.h"
#include "Calculation.h"

// ------------------------------------------------------------------------------------------
// プロトタイプ宣言
// ------------------------------------------------------------------------------------------
// 詳細設定
void SetObjWindow(
	D3DXVECTOR3 *pos,	// 位置
	D3DXVECTOR3 *size,	// サイズ
	int *nBlock_H,		// 縦ブロック
	int *nBlock_W		// 横ブロック
);
void EditWindowRegister(HINSTANCE hInstance);
void CreateEditWindow(HINSTANCE hInstance, int CmdShow);
void EditWindowUnregister(void);
#endif