// ------------------------------------------------------------------------------------------
//
// UIヘッダー処理の説明[ui.h]
// Author : Koki Nishiyama
//
// ------------------------------------------------------------------------------------------

#ifndef _UI_H_
#define _UI_H_	 // ファイル名を基準を決める

// ------------------------------------------------------------------------------------------
//
// インクルードファイル
//
// ------------------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS

#include "main.h"

// ------------------------------------------------------------------------------------------
//
// マクロ定義
//
// ------------------------------------------------------------------------------------------

#define UI_ON_Y (320)		// 上
#define UI_MAX (2)				// 画像数
// ------------------------------------------------------------------------------------------
//
// UI種類
//
// ------------------------------------------------------------------------------------------

typedef enum
{
	UITYPE_TIMEFRAME = 0,
	UITYPE_TIMENAME,
	UITYPE_SCOREFRAME,
	UITYPE_SCORECAT1,
	UITYPE_SCORECAT2,
	UITYPE_HPNAME,
	UITYPE_MAX
}UITYPE;
// ------------------------------------------------------------------------------------------
//
// 構造体定義
//
// ------------------------------------------------------------------------------------------

typedef struct
{
	UITYPE Type;	// タイプ
	D3DXVECTOR3 pos;	// 位置
	D3DXVECTOR3 move;	// 移動量
	D3DXCOLOR col;		// カラー
	float fXSize;		// Xサイズ
	float fYSize;		// Yサイズ
	bool bUse;			// 使用しているかどうか
} UI;

// ------------------------------------------------------------------------------------------
//
// プロトタイプ宣言
//
// ------------------------------------------------------------------------------------------

// 基本プロトタイプ	//
void InitUi(void);
void UninitUi(void);
void UpdateUi(void);
void DrawUi(void);
void SetUi(D3DXVECTOR3 pos,D3DXVECTOR3 move,UITYPE Type ,D3DXCOLOR col ,float fXSize,float fYSize);
UI *GetUi(void);

#endif